###############################################################################
# Created by write_sdc
# Sat Jun  4 23:57:38 2022
###############################################################################
current_design hp35_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name osc_in -period 10.0000 [get_ports {osc_in}]
set_clock_transition 0.1500 [get_clocks {osc_in}]
set_clock_uncertainty 0.2500 osc_in
set_propagated_clock [get_clocks {osc_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {COL[0]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {COL[1]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {COL[2]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {COL[3]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {COL[4]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {PWO}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {bcd_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {carry_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {cdiv_rst}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_arc_dummy}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_enable_arc}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_enable_ctc}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_enable_rom}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_force_data}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_internal_cdiv}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[0]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[1]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[2]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[3]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[4]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[5]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[6]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[7]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[8]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_romdata[9]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_sram_csb1}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {ia_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {is_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {phi1_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {phi2_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[0]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[10]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[11]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[12]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[13]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[14]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[15]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[16]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[17]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[18]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[19]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[1]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[20]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[21]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[22]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[23]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[24]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[25]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[26]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[27]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[28]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[29]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[2]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[30]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[31]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[3]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[4]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[5]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[6]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[7]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[8]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {srdata[9]}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sync_in}]
set_input_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {ws_in}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {DD[0]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {DD[1]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {DD[2]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {DD[3]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {DD[4]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {START}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {bcd_bus}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {bcd_oe}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {carry_bus}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_arc_a1}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_arc_b1}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_arc_t1}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_arc_t4}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_kdn}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_q[0]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_q[1]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_q[2]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_q[3]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_q[4]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_q[5]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_ctc_state1}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_dsbf[0]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_dsbf[1]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_dsbf[2]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_dsbf[3]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_dsbf[4]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_rom_roe[0]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_rom_roe[1]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {dbg_rom_roe[2]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {ia_bus}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {is_bus}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {is_oe}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {phi1_out}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {phi2_out}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[0]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[1]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[2]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[3]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[4]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[5]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[6]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sraddr_mux[7]}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sram_clk1}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {sync_bus}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {ws_bus}]
set_output_delay 2.0000 -clock [get_clocks {osc_in}] -add_delay [get_ports {ws_oe}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {START}]
set_load -pin_load 0.0334 [get_ports {bcd_bus}]
set_load -pin_load 0.0334 [get_ports {bcd_oe}]
set_load -pin_load 0.0334 [get_ports {carry_bus}]
set_load -pin_load 0.0334 [get_ports {dbg_arc_a1}]
set_load -pin_load 0.0334 [get_ports {dbg_arc_b1}]
set_load -pin_load 0.0334 [get_ports {dbg_arc_t1}]
set_load -pin_load 0.0334 [get_ports {dbg_arc_t4}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_kdn}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_state1}]
set_load -pin_load 0.0334 [get_ports {ia_bus}]
set_load -pin_load 0.0334 [get_ports {is_bus}]
set_load -pin_load 0.0334 [get_ports {is_oe}]
set_load -pin_load 0.0334 [get_ports {phi1_out}]
set_load -pin_load 0.0334 [get_ports {phi2_out}]
set_load -pin_load 0.0334 [get_ports {sram_clk1}]
set_load -pin_load 0.0334 [get_ports {sync_bus}]
set_load -pin_load 0.0334 [get_ports {ws_bus}]
set_load -pin_load 0.0334 [get_ports {ws_oe}]
set_load -pin_load 0.0334 [get_ports {DD[4]}]
set_load -pin_load 0.0334 [get_ports {DD[3]}]
set_load -pin_load 0.0334 [get_ports {DD[2]}]
set_load -pin_load 0.0334 [get_ports {DD[1]}]
set_load -pin_load 0.0334 [get_ports {DD[0]}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_q[5]}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_q[4]}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_q[3]}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_q[2]}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_q[1]}]
set_load -pin_load 0.0334 [get_ports {dbg_ctc_q[0]}]
set_load -pin_load 0.0334 [get_ports {dbg_dsbf[4]}]
set_load -pin_load 0.0334 [get_ports {dbg_dsbf[3]}]
set_load -pin_load 0.0334 [get_ports {dbg_dsbf[2]}]
set_load -pin_load 0.0334 [get_ports {dbg_dsbf[1]}]
set_load -pin_load 0.0334 [get_ports {dbg_dsbf[0]}]
set_load -pin_load 0.0334 [get_ports {dbg_rom_roe[2]}]
set_load -pin_load 0.0334 [get_ports {dbg_rom_roe[1]}]
set_load -pin_load 0.0334 [get_ports {dbg_rom_roe[0]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[7]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[6]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[5]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[4]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[3]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[2]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[1]}]
set_load -pin_load 0.0334 [get_ports {sraddr_mux[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {PWO}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bcd_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {carry_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cdiv_rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_arc_dummy}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_enable_arc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_enable_ctc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_enable_rom}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_force_data}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_internal_cdiv}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_sram_csb1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ia_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {is_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {osc_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {phi1_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {phi2_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sync_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ws_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {COL[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {COL[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {COL[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {COL[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {COL[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dbg_romdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {srdata[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 8.0000 [current_design]
